"Part1" = "ภาษาไทย";
"Part2" = "APPLE INC.";
"Part3" = "สัญญาอนุญาตให้ใช้สิทธิในซอฟต์แวร์ SHORTCUTS for iOS";
"Part4" = "โปรดอ่านสัญญาอนุญาตให้ใช้สิทธิในซอฟต์แวร์นี้ (“ใบอนุญาตให้ใช้สิทธิ”) อย่างรอบคอบก่อนใช้ซอฟต์แวร์ ของ Apple โดยการใช้ซอฟต์แวร์ของ Apple ท่านตกลงที่จะผูกพันตามข้อกำหนดของใบอนุญาตให้ใช้สิทธินี้ ถ้าท่านไม่ตกลงตามข้อกำหนดของใบอนุญาตให้ใช้สิทธินี้ อย่าติดตั้งและหรือใช้ซอฟต์แวร์";
"Part5" = "ข้อความสำคัญ  เท่าที่ซอฟต์แวร์นี้อาจใช้ทำซ้ำ ดัดแปลง จัดพิมพ์ และจัดจำหน่ายซึ่งสิ่งต่าง ๆ ได้ ท่านได้รับอนุญาตให้ทำซ้ำ ดัดแปลง จัดพิมพ์ และจัดจำหน่ายเฉพาะสิ่งที่ไม่มีลิขสิทธิ์ สิ่งที่ท่านเป็นเจ้าของลิขสิทธิ์ หรือสิ่งที่ท่านมีอำนาจหรือกฎหมายอนุญาตให้ท่านทำซ้ำ ดัดแปลง จัดพิมพ์ หรือจัดจำหน่ายได้เท่านั้น  ถ้าท่านไม่มั่นใจเกี่ยวกับสิทธิของท่านที่จะทำสำเนา ดัดแปลง จัดพิมพ์ หรือจัดจำหน่ายสิ่งใด ท่านควรติดต่อที่ปรึกษากฎหมายของท่าน";
"Part6" = "1.     ทั่วไป";
"Part7" = "ก. ซอฟต์แวร์ของ Apple และของบุคคลภายนอก เอกสาร ส่วนต่อประสาน เนื้อหา ชุดแบบอักษร และข้อมูลใดๆที่มีมาพร้อมกับการให้ใช้สิทธินี้ ไม่ว่าจะในรูปของ รอม หรือสื่ออื่นใดหรือแบบอื่นใด (เรียกรวมกันว่า “ซอฟต์แวร์ของ Apple”) เป็นซอฟต์แวร์ที่บริษัท Apple Inc. (“Apple”) ให้ท่านใช้สิทธิ์ ไม่ได้ขายให้แก่ท่าน สำหรับใช้ตามข้อกำหนดของการให้ใช้สิทธิ์นี้ และ Apple และหรือผู้ให้ใช้สิทธิของ Apple ยังคงเป็นเจ้าของกรรมสิทธิ์ในตัวซอฟต์แวร์ของ Apple และขอสงวนสิทธิ์ทั้งปวงที่มิได้ให้ไว้แก่ท่านโดยชัดแจ้ง ";
"Part8" = "ข. Apple อาจมีดุลพินิจในการจัดทำซอฟต์แวร์อัพเกรดหรืออัพเดทของ Apple ที่อาจมีขึ้นในอนาคตสำหรับอุปกรณ์ ระบบปฏิบัติการ Apple ของท่านที่เข้ากันได้ โดยที่ซอฟต์แวร์อัพเกรดและอัพเดทของ Apple (หากมี) อาจไม่รวมถึงรูปแบบการใช้งานของซอฟต์แวร์ทั้งหมดที่มีอยู่ในปัจจุบัน หรือรูปแบบการทำงานแบบใหม่ที่ Apple ได้ทำออกมาสำหรับระบบปฏิบัติการรุ่นใหม่ เวอร์ชั่นใหม่ หรือระบบปฏิบัติการอื่นๆ ข้อกำหนดของใบอนุญาตให้ใช้สิทธินี้ใช้บังคับแก่การอัพเกรดหรืออัพเดทซอฟต์แวร์ใด ๆ ที่ Apple จัดให้แก่ผลิตภัณฑ์ซอฟต์แวร์ของ Apple ตัวเดิม เว้นแต่การอัพเกรดหรืออัพเดทนั้นจะมีใบอนุญาตให้ใช้สิทธิแยกต่างหาก ซึ่งในกรณีเช่นนั้น ท่านตกลงให้การอัพเกรดหรืออัพเดทบังคับตามข้อกำหนดของใบอนุญาตให้ใช้สิทธินั้น";
"Part9" = "2.     การใช้สิทธิที่ได้รับอนุญาตและข้อจำกัดในการใช้";
"Part10" = "ก. ใบอนุญาตให้ใช้สิทธิ ภายใต้บังคับข้อกำหนดและเงื่อนไขของใบอนุญาตให้ใช้สิทธินี้ และตามที่ได้รับอนุญาตใน “กฎการใช้งานบริการและเนื้อหา” ที่กำหนดอยู่ในเงื่อนไขและข้อกำหนดของบริการสื่อของ Apple  (https://www.apple.com/legal/internet-services/itunes /) (“กฎการใช้งาน”) เว้นแต่ท่านจะได้รับซอฟต์แวร์ของ Apple ตามที่ระบุอยู่ในข้อ 2 ข. ท่านได้รับอนุญาตอย่างจำกัดไม่อาจโอนได้ และไม่ผูกขาดให้ติดตั้ง และใช้งานซอฟต์แวร์ของ Apple ในอุปกรณ์ iOS ยี่ห้อ Apple ที่ใช้ด้วยกันได้ที่ท่านเป็นเจ้าของหรือควบคุม ท่านไม่อาจแจกจ่ายหรือจัดให้มีซอฟต์แวร์ของ Apple บนเครือข่ายที่อุปกรณ์ดังกล่าวหลายเครื่องสามารถใช้งานซอฟต์แวร์ของ Apple ในเวลาเดียวกันได้ ท่านไม่อาจนำซอฟต์แวร์ของ Apple ไปให้เช่า ให้ยืม ขาย จำหน่ายต่อ หรืออนุญาตให้ใช้ช่วงได้";
"Part11" = "ข. ใบอนุญาตให้ใช้สิทธิแบบปริมาณมากหรือในการบำรุงรักษา  ถ้าท่านได้รับซอฟต์แวร์ของ Apple ตามโครงการอนุญาตให้ใช้สิทธิแบบปริมาณมากหรือในการบำรุงรักษากับ Apple ข้อกำหนดในใบอนุญาตให้ใช้สิทธิแบบปริมาณมากหรือในการบำรุงรักษาของท่านจะกำหนดจำนวนสำเนาซอฟต์แวร์ของ Apple ที่ท่านได้รับอนุญาตให้ดาวน์โหลด ติดตั้ง ใช้ และใช้งานกับอุปกรณ์ iOS ยี่ห้อ Apple ซึ่งท่านเป็นเจ้าของหรือควบคุมอยู่ได้  เว้นแต่ Apple จะทำหนังสือตกลงเป็นอย่างอื่น ข้อกำหนดและเงื่อนไขอื่น ๆ ทั้งปวงของใบอนุญาตให้ใช้สิทธินี้ ให้บังคับแก่การที่ท่านใช้ซอฟต์แวร์ของ Apple ที่ได้มาตามใบอนุญาตให้ใช้สิทธิแบบปริมาณมากหรือในการบำรุงรักษาด้วย";
"Part12" = "ค. ข้อกำหนดของระบบ โปรดทราบว่า ซอฟต์แวร์ของ Apple ใช้ได้กับฮาร์ดแวร์ยี่ห้อ Apple ที่เป็นไปตามข้อกำหนดระบบที่ Apple กำหนดท่านั้น";
"Part13" = "ง. เนื้อหาและข้อมูลดิจิตอล กรรมสิทธิ์และสิทธิในทรัพย์สินทางปัญญาในเนื้อหาใด ๆ รวมทั้งเครื่องหมายการค้า โลโก้ และภาพ ที่แสดงโดยหรือเข้าถึงผ่านซอฟต์แวร์ของ Apple ย่อมตกแก่เจ้าของเนื้อหานั้น ๆ  เนื้อหาเช่นว่านั้นอาจได้รับการคุ้มครองโดยกฎหมายและสนธิสัญญาว่าด้วยลิขสิทธิ์ เครื่องหมายการค้า หรือทรัพย์สินทางปัญญาประเภทอื่นและอาจอยู่ภายใต้บังคับข้อกำหนดการใช้ของบุคคลภายนอกซึ่งเป็นผู้ให้เนื้อหานั้นได้ เว้นแต่จะได้มีการระบุไว้ในใบอนุญาตให้ใช้สิทธินี้ (1) ใบอนุญาตให้ใช้สิทธินี้ไม่ให้สิทธิใด ๆ แก่ท่านที่จะใช้เนื้อหานั้นหรือไม่รับประกันว่า เนื้อหานั้นจะยังคงจัดให้ท่านอยู่ต่อไป และ (2) ท่านจะใช้ แยก หรือจำหน่ายภาพถ่าย โลโก้ ข้อความ รหัส รูปภาพ ภาพพิมพ์กราฟฟิกส์ งานศิลป์ งานที่เป็นเสียง งานที่เป็นภาพ หรือทรัพย์สินอื่นใดที่มีลักษณะคล้ายคลึงกัน (“ข้อมูลดิจิตอล”) ที่บรรจุอยู่ในหรือจัดทำขึ้นเพื่อเป็นส่วนหนึ่งส่วนใดของซอฟต์แวร์ Apple เพื่อการพาณิชย์หรือเพื่อประการอื่นใดในลักษณะที่เป็นการแยกทรัพย์ดังกล่าวออกเป็นส่วนๆ มิได้ หรือจะใช้ข้อมูลดิจิตอลนอกเหนือไปจากขอบเขตวัตถุประสงค์การใช้งานในฐานะที่เป็นส่วนหนึ่งของซอฟต์แวร์ Apple มิได้";
"Part14" = "จ. การใช้งาน Shortcuts ท่านรับทราบว่า Shortcuts ที่ดำเนินการทางแอพและ/หรือเว็บไซต์ (“Shortcuts”) เป็นความรับผิดชอบแต่เพียงผู้เดียวของฝ่ายที่จัดให้มี Shortcuts ขึ้น Apple ไม่มีการควบคุมและไม่มีความรับผิดชอบสำหรับเนื้อหาหรือการทำงานของ Shortcuts ของบุคคลภายนอกใดๆ ท่านใช้งาน Shortcuts โดยความเสี่ยงของตัวท่านเองและท่านจะต้องรับผิดชอบแต่เพียงผู้เดียวในการปฏิบัติตามข้อกำหนดหรือสัญญาของบุคคลภายนอกใดๆ ที่เกิดจากการที่ท่านใช้งาน Shortcuts ใดๆ ท่านรับทราบว่า Apple ไม่มีหน้าที่ที่จะคัดกรอง Shortcuts ก่อนแม้ว่า Apple สงวนสิทธิ์ที่จะใช้ดุลพินิจของตนเองแต่เพียงผู้เดียวที่จะคัดกรองล่วงหน้า ปฏิเสธ ปิดการใช้งาน หรือลบ Shortcuts ใดๆ ";
"Part15" = "ฉ. การแบ่งปัน Shortcuts ซอฟต์แวร์ของ Apple อาจอนุญาตให้ท่านแบ่งปัน Shortcuts ที่ท่านสร้างขึ้นให้แก่ผู้อื่นผ่านทางส่วนเชื่อมต่อของเว็บไซต์ Shortcut ที่ท่านแบ่งปันพร้อมด้วยเนื้อหาใดๆ ที่มีอยู่ภายใน จะถูกจัดเก็บไว้ในเซิร์ฟเวอร์ของ Apple เพื่อทำให้การแบ่งปันดังกล่าวใช้งานได้และอาจถูกใช้เพื่อปรับปรุงผลิตภัณฑ์และบริการต่างๆ ของ Apple โดยทั่วไป Shortcut ที่ท่านแบ่งปันพร้อมด้วยเนื้อหาใดๆ ที่มีอยู่ภายในจะมีให้บริการแก่บุคคลใดๆ ก็ตามที่เข้าถึงส่วนเชื่อมต่อของเว็บไซต์ได้โดยบุคคลดังกล่าวอาจทำสำเนา จัดเก็บ ดัดแปลง และแจกจ่ายซ้ำซึ่งสำเนา Shortcut ของท่านและเนื้อหาทั้งหมดที่มีอยู่ภายใน โดยการแบ่งปัน Shortcut ท่านรับรองว่า (1) ท่านมีสิทธิและใบอนุญาตให้ใช้สิทธิที่จำเป็นทั้งปวงสำหรับ Shortcut ดังกล่าว และShortcut ดังกล่าวจะไม่ฝ่าฝืนหรือละเมิดสิทธิของบุคคลอื่นใด และ (2) Shortcut ใดๆ ที่ท่านแบ่งปันจะไม่ละเมิดกฎหมายใดๆ มีส่วนหรือสนับสนุนให้เกิดการฝ่าฝืนกฎหมายหรือการปฏิบัติที่ผิดกฎหมายอื่นๆ  หรือมีลักษณะลามกอนาจารหรือน่ารังเกียจโดยประการอื่น ท่านรับรองว่า Apple ไม่มีหน้าที่ตรวจสอบ Shortcuts ใดๆ ที่ท่านแบ่งปันแม้ว่า Apple สงวนสิทธิ์ที่จะใช้ดุลพินิจของตนเองแต่เพียงผู้เดียวที่จะตรวจสอบ ปิดการใช้งาน หรือลบ Shortcuts ใดๆ ที่ท่านแบ่งปัน";
"Part16" = "ช. ข้อจำกัดการใช้งาน ท่านตกลงที่จะไม่อัพโหลด โพสต์ ส่งอีเมล ถ่ายทอด แบ่งปัน หรือทำให้มีอยู่โดยประการอื่นซึ่ง Shortcuts ใดๆ ที่ (1) ผิดกฎหมาย เป็นการละเมิด หมิ่นประมาท หยาบคาย ลามก ดูหมิ่น หรือเป็นการดูถูกเชื้อชาติ ชาติพันธุ์ หรือประการอื่น (2) ฝ่าฝืนหรือส่งเสริมให้มีการกระทำใดๆ ที่จะฝ่าฝืนกฎหมายหรือระเบียบกฎเกณฑ์ที่ใช้บังคับใดๆ หรือที่จะก่อให้เกิดความรับผิดในทางแพ่ง (3) ส่งเสริมการเลือกปฏิบัติ การต่อต้านผู้เห็นต่าง การเหยียดผิว ความเกลียดชัง การล่วงละเมิด หรืออันตรายต่อบุคคลหรือกลุ่มบุคคลใดๆ (4) มีลักษณะของการใช้ความรุนแรงหรือคุกคาม หรือส่งเสริมให้ใช้ความรุนแรงหรือการกระทำที่มีลักษณะเป็นการคุกคามบุคคลอื่นใด (5) ส่งเสริมกิจกรรมที่ผิดกฎหมายหรือเป็นอันตราย หรือ (6) ท่านทราบหรือเชื่อว่าเป็นความเท็จ ก่อให้เกิดความเข้าใจผิด ฉ้อฉล หรือมีลักษณะหลอกลวงไม่ว่าในทางใดต่อผู้ใช้งาน Shortcut ดังกล่าว ท่านตกลงต่อไปที่จะไม่แทรกแซง ทำให้หยุดชะงัก หรือสร้างภาระอย่างไม่สมควรต่อเซิร์ฟเวอร์หรือโครงข่ายที่เชื่อมต่อกับซอฟต์แวร์ของ Apple หรือแอพพลิเคชั่นซอฟต์แวร์ บริการ หรือเว็บไซต์ของบุคคลภายนอกใดๆ ในอุปกรณ์ iOS ของท่าน (“แอพของบุคคลภายนอก”) หรือฝ่าฝืนระเบียบ นโยบาย หรือขั้นตอนการทำงานของโครงข่ายหรือของแอพของบุคคลภายนอกดังกล่าว";
"Part17" = "ซ. แอพของบุคคลภายนอก เพื่อที่จะทำให้บาง Shortcuts มีผลสมบูรณ์ ซอฟต์แวร์ของ Apple อาจจำเป็นต้องเข้าถึง  แอพของบุคคลภายนอกบางอย่าง ท่านให้ความยินยอมอย่างชัดแจ้งและอนุญาตให้ซอฟต์แวร์ของ Apple เข้าถึงและใช้งานแอพของบุคคลภายนอกเหล่านี้ในนามของท่านตามที่จำเป็นเพื่อทำให้ Shortcuts ดังกล่าวมีผลสมบูรณ์กับซอฟต์แวร์ของ Apple ตราบเท่าที่ซอฟต์แวร์ของ Apple ต้องเข้าถึงแอพของบุคคลภายนอกใดๆ Apple ไม่มีหน้าที่ไม่ว่าโดยชัดแจ้งหรือโดยปริยายที่จะต้องให้การสนับสนุนทางเทคนิคใดๆ หรือการสนับสนุนอื่นๆ แก่แอพของบุคคลภายนอกดังกล่าว กรุณาติดต่อผู้ขาย ผู้ผลิต หรือผู้ให้บริการซอฟต์แวร์ที่เกี่ยวข้องโดยตรงสำหรับการสนับสนุนทางเทคนิคและการบริการลูกค้าที่เกี่ยวข้องกับซอฟต์แวร์ บริการ เว็บไซต์ และ/หรือผลิตภัณฑ์ของบุคคลดังกล่าว ท่านตกลงต่อไปว่าท่านจะถูกผูกพันและตกลงที่จะปฏิบัติตามข้อกำหนดของการบริการที่ใช้บังคับทั้งหมดหรือข้อตกลงอื่นๆ สำหรับแอพ ของบุคคลภายนอกดังกล่าวเมื่อใช้ซอฟต์แวร์ของ Apple ท่านจะต้องรับผิดชอบแต่เพียงผู้เดียวที่จะให้แน่ใจว่า Shortcuts ทั้งหมดจะเป็นไปตามข้อกำหนดที่ใช้บังคับสำหรับแอพของบุคคลภายนอกแต่ละแอพที่ Shortcuts ใช้ Apple จะไม่รับประกันไม่ว่าในทางใดว่า Shortcuts จะเป็นไปตามข้อกำหนดสำหรับแอพของบุคคลภายนอกใดๆ และ Apple จะไม่รับผิดชอบสำหรับ Shortcuts ของบุคคลภายนอกใดๆ ";
"Part18" = "ฌ. ห้ามทำวิศวกรรมย้อนกลับ    ท่านไม่อาจและตกลงที่จะไม่กระทำการต่อไปนี้หรือทำให้ผู้อื่นกระทำการต่อไปนี้ได้ คือ ทำสำเนา (เว้นแต่จะได้รับอนุญาตโดยชัดแจ้งโดยใบอนุญาตให้ใช้สิทธินี้หรือโดยกฎการใช้ ถ้าบังคับใช้แก่ท่านได้) กระจาย ทำวิศวกรรมย้อนกลับ แยกประกอบ หรือพยายามที่จะดึงรหัสต้นฉบับ หรือถอดรหัส หรือแก้ไข หรือสร้างงานอนุพันธ์ของซอฟต์แวร์ของ Apple หรือบริการใดๆ ที่ซอฟต์แวร์ของ Apple หรือส่วนใดๆ ของซอฟต์แวร์ของ Apple จัดให้ (เว้นแต่และเฉพาะเท่าที่กฎหมายที่ใช้บังคับจะห้ามมิให้มีข้อจำกัดใด ๆ ข้างต้นหรือโดยข้อกำหนดของใบอนุญาตให้ใช้สิทธิว่าด้วยการใช้ส่วนประกอบโอเพนซอร์ซซึ่งรวมอยู่กับซอฟต์แวร์ Apple)";
"Part19" = "ญ. การปฏิบัติตามกฎหมาย  ท่านตกลงที่จะใช้ซอฟต์แวร์ของ Apple และบริการ (ตามที่นิยามไว้ในข้อ 4 ข้างล่างนี้) โดยปฏิบัติตามกฎหมายที่ใช้บังคับทั้งปวง รวมทั้งกฎหมายท้องถิ่นของประเทศหรือภูมิภาคที่ท่านพำนักอยู่หรือที่ท่านดาวน์โหลดหรือใช้ซอฟต์แวร์ของ Apple และบริการ";
"Part20" = "ฎ. การอัปเดตอัตโนมัติ	ถ้าหากท่านเลือกให้มีการอัพเดตแอพอัตโนมัติ ซอฟต์แวร์ของ Apple จะตรวจสอบไปยัง Apple เป็นระยะๆ เกี่ยวกับ การอัปเดตและอัพเกรดซอฟต์แวร์ของ Apple โดยถ้าการอัปเดตหรืออัพเกรด นั้นมีการจัดทำขึ้น การอัปเดตหรืออัพเกรดอาจถูกดาวน์โหลดและติดตั้งไปยังคอมพิวเตอร์ของท่าน และอุปกรณ์เชื่อมต่อคอมพิวเตอร์ของท่าน (หากสามารถปรับใช้ได้) โดยอัตโนมัติ ท่านสามารถปิดการใช้งานการอัปเดตแอพอัตโนมัติทั้งหมดพร้อมกันได้ทุกเมื่อ โดยการเปลี่ยนการตั้งค่าการอัปเดตแอพอัตโนมัติซึ่งจะพบอยู่ในตั้งค่าระบบ";
"Part21" = "3.     ยินยอมให้ใช้ข้อมูล     ";
"Part22" = "ก. ข้อมูลการวิเคราะห์ ถ้าท่านเลือกให้เก็บข้อมูลการวิเคราะห์ ท่านตกลงว่า Apple ตลอดจนบริษัทย่อยและตัวแทน อาจรวบรวม เก็บรักษา ประมวลผล และใช้ข้อมูลวินิจฉัย ข้อมูลเทคนิค ข้อมูลการใช้ และข้อมูลที่เกี่ยวข้อง ซึ่งรวมถึงโดยไม่จำกัดเฉพาะการระบุลักษณะเฉพาะของระบบหรือฮาร์ดแวร์ สารสนเทศเกี่ยวกับอุปกรณ์ iOS คอมพิวเตอร์ ซอฟต์แวร์ระบบและแอพพลิเคชั่นซอฟต์แวร์ รวมทั้งอุปกรณ์พ่วงของท่าน ซึ่งเก็บรวบรวมเป็นระยะ เพื่อให้และปรับปรุงผลิตภัณฑ์และบริการของ Apple อำนวยความสะดวกแก่การให้บริการอัปเดตซอฟต์แวร์ การสนับสนุนผลิตภัณฑ์ และบริการอื่นๆ ถึงท่าน (ถ้ามี) อันเกี่ยวกับซอฟต์แวร์ของ Apple และเพื่อตรวจสอบการปฏิบัติตามข้อกำหนดของใบอนุญาตให้ใช้สิทธินี้ Apple จะใช้สารสนเทศนี้เท่าที่ยังเก็บรวบรวมอยู่ในรูปแบบซึ่งไม่ระบุตัวตนของท่าน เพื่อวัตถุประสงค์ที่ระบุข้างต้น  เพื่อที่จะช่วยให้หุ้นส่วนของ Apple และผู้พัฒนาซึ่งเป็นบุคคลภายนอกได้พัฒนาซอฟท์แวร์ ฮาร์ดแวร์ และการบริการที่ถูกออกแบบมาเพื่อให้ใช้กับสินค้าของ Apple ให้ดียิ่งขึ้น Apple อาจจัดทำให้แก่หุ้นส่วนและผู้พัฒนาซึ่งเป็นบุคคลภายนอก ซึ่งส่วนย่อยของข้อมูลเชิงวินิจฉัย อันมีความเกี่ยวข้องกับซอฟท์แวร์ ฮาร์ดแวร์ และ/หรือ การบริการของหุ้นส่วน หรือผู้พัฒนา ตราบที่ข้อมูลเชิงวินิจฉัยนั้นอยู่ในรูปแบบที่ไม่ได้ระบุตัวท่านเป็นการเฉพาะเจาะจง";
"Part23" = "ข. ข้อมูลเชิงพื้นที่ Apple และหุ้นส่วนของ Apple ผู้รับอนุญาตให้ใช้สิทธิ์ และผู้พัฒนาซึ่งเป็นบุคคลภายนอกอาจจัดให้มีบริการบางประเภทผ่านซอฟต์แวร์ของ Apple  ของท่านโดยใช้และหรืออาศัยข้อมูลสารสนเทศของพื้นที่  เพื่อที่จะจัดให้มีและปรับปรุงบริการดังกล่าวในพื้นที่ที่สามารถให้บริการได้ Apple และหุ้นส่วนของ Apple ผู้รับอนุญาตให้ใช้สิทธิ์ และผู้พัฒนาซึ่งเป็นบุคคลภายนอกอาจส่ง รวบรวม เก็บรักษา ประมวลผล และใช้ข้อมูลเชิงพื้นที่ของท่าน ข้อมูลเชิงพื้นที่และรายการสืบค้นที่ตั้งที่ Apple รวบรวมจะถูกเก็บรวบรวมไว้ในรูปแบบที่ไม่ระบุรูปพรรณของท่าน และ Apple และหุ้นส่วนของ Apple ผู้รับอนุญาตให้ใช้สิทธิ์ และผู้พัฒนาซึ่งเป็นบุคคลภายนอกอาจนำไปใช้ในการจัดหา และพัฒนาผลิตภัณฑ์และบริการเชิงพื้นที่ได้ โดยการใช้รูปแบบการใช้งานหรือบริการเชิงพื้นที่ใดๆ ที่ได้จัดทำขึ้นหรือจัดทำผ่านซอฟต์แวร์ของ Apple ท่านตกลงและยินยอมให้ Apple และหุ้นส่วนของ Apple ผู้รับอนุญาตให้ใช้สิทธิ์ และผู้พัฒนาซึ่งเป็นบุคคลภายนอก ส่ง รวบรวม เก็บรักษา ประมวลผล และใช้ข้อมูลเชิงพื้นที่และรายการสืบค้นที่ตั้งของท่าน เพื่อจัดหา และพัฒนาผลิตภัณฑ์และบริการดังกล่าว ท่านอาจถอนความยินยอมนี้เมื่อใดก็ได้ โดยไปที่บริการเชิงพื้นที่ (Location Services) บนอุปกรณ์ iOS ของท่านและปิดการตั้งบริการเชิงพื้นที่ทั่วโลกหรือปิดการตั้งค่าพื้นที่เฉพาะ (individual location) สำหรับซอฟต์แวร์ของ Apple ของท่าน เมื่อมีการเข้าใช้แอพพลิเคชั่นและบริการของบุคคลภายนอกโดยใช้อุปกรณ์ iOS ซึ่งใช้หรือให้ข้อมูลพื้นที่ ท่านจะต้องปฏิบัติตามและพึงศึกษาข้อกำหนดและนโยบายของแอพพลิเคชั่นหรือบริการของบุคคลภายนอกเกี่ยวกับความเป็นส่วนตัวในเรื่องการใช้ข้อมูลเชิงพื้นที่";
"Part24" = "ค. นโยบายความเป็นส่วนตัว ไม่ว่าในเวลาใด ๆ สารสนเทศของท่านจะได้รับการปฏิบัติตามนโยบายความเป็นส่วนตัวของ Apple ซึ่งสามารถอ่านได้ที่ https://www.apple.com/legal/privacy/";
"Part25" = "4.     บริการและข้อมูลของบุคคลภายนอก";
"Part26" = "ก. ทั่วไป ซอฟต์แวร์ของ Apple อาจทำให้สามารถเข้าถึง ร้าน iTunes Store, App Store, iCloud,  Maps ของ Apple และการบริการอื่นๆ ของ Apple และของบุคคลภายนอก ซึ่งรวมทั้งเว็บไซต์ต่างๆ (รวมกันและแยกกันเรียกว่า “บริการ”) ได้ บริการดังกล่าวอาจไม่มีให้ในทุกภาษาหรือในทุกประเทศ การใช้บริการนี้จะต้องเข้าอินเทอร์เน็ต และในการใช้บริการบางอย่าง ซึ่งอาจจำต้องใช้ Apple ID ของท่าน ท่านอาจจำต้องยอมรับข้อกำหนดเพิ่มเติม และอาจต้องชำระค่าธรรมเนียมเพิ่มเติม เมื่อท่านใช้ซอฟต์แวร์นี้ในส่วนที่เกี่ยวกับบัญชี iTunes Store Apple ID หรือบริการของ Apple ประเภทอื่น แสดงว่าท่านตกลงตามเงื่อนไขบริการที่เกี่ยวข้องกับบริการนั้น เช่น ข้อกำหนดและเงื่อนไขล่าสุดของบริการสื่อของ Apple ซึ่งท่านเข้าดูได้ที่ https://www.apple.com/legal/internet-services/itunes /";
"Part27" = "ข. ถ้าหากท่านเลือกใช้บริการ iCloud ผ่านทางซอฟต์แวร์ของ Apple การใช้ดังกล่าวจะอยู่ภายใต้ข้อกำหนดเพิ่มเติมดังนี้ คือ ข้อกำหนดและเงื่อนไขเพิ่มเติมของ iCloud ซึ่งปรากฎอยู่ที https://www.apple.com/legal/internet-services/icloud / และนโยบายความเป็นส่วนตัวของ Apple ปรากฏอยู่ที่ https://www.apple.com/legal/privacy/";
"Part28" = "ค. ท่านเข้าใจว่า โดยการใช้บริการใดๆ ท่านอาจจะพบกับเนื้อหาที่อาจถือว่าหยาบคาย ไม่เหมาะสม หรือน่ารังเกียจ ซึ่งจะจัดเป็นเนื้อหาที่ใช้ภาษาที่ชัดแจ้งหรือไม่ก็ได้ อย่างไรก็ตาม ท่านตกลงที่จะใช้บริการด้วยความเสี่ยงของท่านเองฝ่ายเดียว และ Apple ไม่มีความรับผิดต่อท่านสำหรับเนื้อหาที่อาจพบว่าหยาบคาย ไม่เหมาะสม หรือน่ารังเกียจ";
"Part29" = "ง. บริการบางอย่างอาจแสดง มี หรือให้บริการ เนื้อหา ข้อมูล สารสนเทศ แอพพลิเคชั่น หรือข้อมูลต่างๆ จากบุคคลภายนอก (“ข้อมูลของบุคคลภายนอก”) หรือให้เชื่อมต่อไปยังบางเว็บไซต์หรือแอพพลิเคชั่นของบุคคลภายนอก โดยการใช้บริการ ท่านยอมรับและตกลงว่า  Apple ไม่รับผิดชอบต่อการตรวจสอบหรือประเมินเนื้อหา ความถูกต้อง ความครบถ้วน ความเหมาะแก่เวลา ความสมบูรณ์ การปฏิบัติตามลิขสิทธิ์ ความถูกต้องตามกฎหมาย ความเหมาะสม คุณภาพหรือลักษณะอื่นใดของข้อมูล แอพพลิเคชั่น หรือเว็บไซต์ของบุคคลภายนอกนั้น  Apple  เจ้าหน้าที่ บริษัทในเครือและบริษัทย่อยของ Apple ไม่รับประกัน หรือรับรอง และไม่รับเอา และจะไม่มีความรับผิดหรือความรับผิดชอบใดๆ ต่อท่าน หรือต่อบุคคลอื่นใด สำหรับการให้บริการของบุคคลภายนอก ข้อมูล แอพพลิเคชั่น หรือเว็บไซต์ของบุคคลภายนอกใดๆ หรือสำหรับข้อมูล ผลิตภัณฑ์หรือการบริการของบุคคลภายนอกอื่นใด ข้อมูลและการเชื่อมต่อไปยังเว็บไซต์ของบุคคลภายนอกหรือแอพพลิเคชั่นของบุคคลภายนอก จัดให้เพื่อความสะดวกแก่ท่านเท่านั้น";
"Part30" = "จ. ในส่วนที่ท่านอัพโหลดเนื้อหาใดๆ ผ่านการใช้บริการ ท่านรับรองว่า ท่านเป็นเจ้าของสิทธิทั้งปวงในเนื้อหานั้นหรือมีอำนาจหรือได้รับอนุญาตตามกฎหมายโดยประการอื่นให้อัพโหลดเนื้อหานั้นได้ และรับรองด้วยว่า เนื้อหานั้นไม่มีลักษณะขัดต่อเงื่อนไขบริการข้อใดๆ ที่เกี่ยวข้องกับบริการ ท่านตกลงว่า บริการมีเนื้อหา สารสนเทศ และข้อมูลที่รวมถึงแต่ไม่จำกัดเพียงข้อมูลดิจิตอลใดๆอันเป็นทรัพยสิทธิ ซึ่ง Apple เจ้าของไซต์ และ/หรือผู้ให้ใช้สิทธิ์ดังกล่าวเป็นเจ้าของ และได้รับการคุ้มครองโดยกฎหมายทรัพย์สินทางปัญญาและกฎหมายอื่นๆ ซึ่งรวมถึงโดยไม่จำกัดเฉพาะลิขสิทธิ์ ท่านตกลงว่าท่านจะไม่ใช้เนื้อหา สารสนเทศ หรือข้อมูลอันเป็นทรัพยสิทธิ นอกเหนือไปจากเพื่อการใช้บริการที่ได้รับอนุญาตแล้ว หรือการใช้งานในลักษณะที่ไม่ได้เป็นไปตามที่ระบุไว้ในข้อกำหนดของการใช้สิทธิ์ฉบับนี้ หรือที่ละเมิดสิทธิในทรัพย์สินทางปัญญาของผู้อื่นหรือของ Apple การบริการส่วนใดๆ จะทำซ้ำในรูปแบบใดหรือโดยวิธีใดไม่ได้ ท่านตกลงที่จะไม่แก้ไข ให้เช่า ให้ยืม ขาย จำหน่าย หรือสร้างงานที่เป็นอนุพันธุ์โดยอาศัยการบริการในลักษณะใดๆ และท่านจะไม่ใช้ประโยชน์ในทางที่ไม่ได้รับอนุญาตใดๆ ก็ตาม ซึ่งรวมถึงโดยไม่จำกัดเฉพาะการใช้บริการเพื่อส่งไวรัสของคอมพิวเตอร์ เวอร์ม ม้าโทรจัน หรือมัลแวร์ หรือโดยการเจาะเข้าไป หรือเพิ่มภาระให้แก่ความสามารถของเครือข่าย ท่านตกลงยินยอมต่อไปที่จะไม่ใช้บริการในลักษณะใดๆ เพื่อลวนลาม ทำร้าย ติดตาม ข่มขู่ ดูหมิ่น หรือละเมิดหรือฝ่าฝืนโดยประการอื่นซึ่งสิทธิของบุคคลอื่นใด และตกลงว่า Apple ไม่รับผิดชอบในทางใดๆ สำหรับการใช้ใดๆ ดังกล่าวโดยท่าน หรือสำหรับข้อความหรือการส่งข้อความอันเป็นการลวนลาม การข่มขู่ การดูหมิ่น น่ารังเกียจ ละเมิดสิทธิ หรือผิดกฎหมาย ซึ่งท่านอาจได้รับเนื่องจากการใช้บริการใดๆ";
"Part31" = "ฉ. นอกจากนั้น บริการและข้อมูลบุคคลภายนอกซึ่งอาจเข้าถึง เชื่อมต่อไปยัง หรือแสดงผ่านซอฟต์แวร์ของ Apple มิได้มีให้ไว้ในทุกภาษาหรือมีอยู่ทุกประเทศหรือภูมิภาค   Apple ไม่ขอรับรองว่า บริการและข้อมูลบุคคลภายนอกดังกล่าวมีความเหมาะสมหรือมีไว้เพื่อใช้เฉพาะพื้นที่ใดๆ เท่าที่ท่านเลือกที่จะใช้หรือเข้าถึงบริการและข้อมูลบุคคลภายนอกดังกล่าว ท่านทำเช่นนั้นด้วยการริเริ่มของท่านเอง และท่านจะต้องรับผิดชอบในการปฏิบัติตามกฎหมายใดๆ ที่ใช้บังคับ ซึ่งรวมถึงโดยไม่จำกัดเฉพาะกฎหมายท้องถิ่นที่ใช้บังคับและกฎหมายว่าด้วยความเป็นส่วนตัวและการเก็บรวบรวมข้อมูล Apple และผู้ให้ใช้สิทธิของ Apple สงวนสิทธิที่จะเปลี่ยน ระงับ ย้ายออก หรือทำให้เข้าถึงบริการใดๆ ไม่ได้ ณ เวลาใดๆ ก็ได้ โดยไม่ต้องแจ้งให้ทราบ ไม่ว่าในกรณีใดๆ Apple จะไม่รับผิดต่อการย้ายออก หรือการทำให้เข้าบริการดังกล่าวใดๆ ไม่ได้ Apple ยังอาจจำกัดการใช้หรือการเข้าถึงบริการบางอย่างอีกด้วยไม่ว่าในกรณีใดโดยไม่ต้องแจ้งให้ทราบหรือต้องรับผิดใด ๆ";
"Part32" = "5.     การสิ้นสุด     ใบอนุญาตให้ใช้สิทธินี้มีผลบังคับไปจนกว่าจะยกเลิก สิทธิของท่านตามใบอนุญาตให้ใช้สิทธินี้จะสิ้นสุดลงโดยอัตโนมัติหรือสิ้นผลแต่โดยประการอื่นโดย Apple ไม่ต้องแจ้งให้ทราบ ถ้าท่านไม่ปฏิบัติตามข้อกำหนดใดของใบอนุญาตให้ใช้สิทธินี้ได้ เมื่อยกเลิกใบอนุญาตให้ใช้สิทธินี้แล้ว ท่านจะต้องหยุดใช้ซอฟต์แวร์ของ Apple ทั้งหมดและทำลายบรรดาสำเนาไม่ว่าทั้งหมดหรือแต่บางส่วนของซอฟต์แวร์ของ Apple ใบอนุญาตให้ใช้สิทธินี้ในข้อ 2ฌ 3 4 5 6 7 8 10 และ 11 ให้มีผลใช้บังคับต่อไปภายหลังใบอนุญาตให้ใช้สิทธินี้สิ้นสุดลง";
"Part33" = "6.     การปฏิเสธการรับประกัน";
"Part34" = "ก.  ถ้าท่านเป็นลูกค้าซึ่งเป็นผู้บริโภค (ผู้ใช้ซอฟต์แวร์ของ Apple นอกจากในทางประกอบกิจการค้า ธุรกิจ หรือวิชาชีพของท่าน) ท่านอาจมีสิทธิตามกฎหมายในประเทศที่ท่านพำนักอยู่ซึ่งห้ามมิให้กำหนดข้อจำกัดต่อไปนี้เพื่อใช้บังคับแก่ท่าน และในกรณีที่ห้าม ข้อจำกัดนั้นจะไม่ใช้บังคับแก่ท่าน สำหรับรายละเอียดเพิ่มเติมเกี่ยวกับสิทธิผู้บริโภคต่าง ๆ ท่านควรติดต่อหน่วยงานให้คำปรึกษาผู้บริโภคในท้องถิ่น";
"Part35" = "ข.  ท่านยอมรับและตกลงโดยชัดแจ้งว่า เท่าที่กฎหมายที่ใช้บังคับอนุญาตให้ทำได้ การใช้ซอฟต์แวร์และบริการใดๆ ของ Appleที่ปฏิบัติการโดยหรือเข้าถึงได้ทางซอฟต์แวร์ของ Apple เป็นความเสี่ยงภัยของท่านเอง และความเสี่ยงภัยทั้งปวงเกี่ยวกับคุณภาพ การทำงาน ความถูกต้อง และความพยายามที่น่าพึงพอใจ ย่อมตกแก่ท่าน ";
"Part36" = "ค.  เท่าที่กฎหมายอนุญาตให้ทำได้สูงสุด ซอฟต์แวร์ของ Apple และบริการต่าง ๆ นั้น จัดให้ “ตามสภาพ”และ “ตามที่มี”  พร้อมกับข้อบกพร่องทั้งปวงโดยไม่มีการรับประกันแต่ประการใดทั้งสิ้น และ Apple และผู้ให้ใช้สิทธิของ Apple  (รวมเรียกว่า “Apple” เพื่อวัตถุประสงค์ของข้อ 6 และข้อ 7) ขอปฏิเสธการรับประกันและเงื่อนไขทั้งปวงในส่วนที่เกี่ยวกับซอฟต์แวร์ของ Apple และบริการ ไม่ว่าโดยชัดแจ้ง โดยปริยาย หรือตามกฎหมาย ซึ่งรวมถึงโดยไม่จำกัดเฉพาะการรับประกันโดยปริยายและหรือสภาพซื้อขายได้ คุณภาพที่น่าพึงพอใจ หรือความเหมาะแก่การใดการหนึ่ง ความถูกต้อง การใช้โดยสงบ และการไม่ละเมิดสิทธิของบุคคลภายนอก";
"Part37" = "ง.  Apple ไม่รับประกันการปราศจากการรบกวนการใช้ซอฟต์แวร์ของ Apple และบริการของท่าน และไม่รับประกันว่า ฟังก์ชันการใช้งานที่มีอยู่ในซอฟต์แวร์ของ Apple หรือที่ซอฟต์แวร์ของ Appleให้หรือจัดให้ จะตอบสนองความต้องการของท่านได้ หรือปฏิบัติการของซอฟต์แวร์ของ Apple หรือบริการจะไม่หยุดชะงักหรือไม่มีข้อผิดพลาด หรือบริการใดๆ จะยังคงมีอยู่ต่อไป หรือซอฟต์แวร์ของ Apple หรือบริการจะได้รับการแก้ไข หรือซอฟต์แวร์ของ Apple จะเข้ากันได้หรือทำงานร่วมกันได้กับซอฟต์แวร์หรือแอพพลิเคชั่น หรือบริการใดๆ ของบุคคลภายนอก การติดตั้งซอฟต์แวร์นี้อาจกระทบการมีให้บริการและความสามารถในการใช้ของแอพพลิเคชั่นหรือซอฟต์แวร์ของบุคคลภายนอกหรือบริการของบุคคลภายนอก ตลอดจนผลิตภัณฑ์และบริการของ Apple";
"Part38" = "จ.  ท่านยอมรับด้วยว่า ซอฟต์แวร์ของ Apple และบริการมิได้มุ่งให้หรือเหมาะสำหรับใช้ในสถานการณ์หรือสภาพแวดล้อมต่างๆ ที่ความล้มเหลว ความล่าช้า ความผิดพลาด หรือความไม่ถูกต้องในเนื้อหา ข้อมูล หรือสารสนเทศที่จัดทำขึ้นโดยซอฟต์แวร์ของ Apple หรือบริการอาจจะนำไปสู่การเสียชีวิต การบาดเจ็บเสียหายส่วนบุคคล หรือความเสียหายทางกายภาพหรือสภาพแวดล้อมอย่างร้ายแรง ซึ่งรวมถึงโดยไม่จำกัดเฉพาะการปฏิบัติการของโรงงานนิวเคลียร์ การนำทางการบินหรือระบบสื่อสารต่างๆ ของเครื่องบิน การควบคุมการจราจรทางอากาศ ระบบกู้ชีพ และระบบอาวุธ ";
"Part39" = "ฉ.  สารสนเทศหรือคำแนะนำที่ Apple หรือผู้แทนที่ได้รับอนุญาตได้ให้ไว้โดยวาจาหรือเป็นหนังสือไม่ก่อให้เกิดการรับประกัน ถ้าพิสูจน์ได้ว่า ซอฟต์แวร์ของ Apple หรือบริการ ชำรุดบกพร่อง ท่านเป็นผู้รับภาระค่าใช้จ่ายทั้งปวงที่จำเป็นแก่การบริการ การซ่อมแซม หรือการแก้ไข บางประเทศไม่อนุญาตให้ยกเว้นการรับประกันโดยปริยายหรือจำกัดสิทธิผู้บริโภคตามกฎหมายที่ใช้บังคับ ดังนั้น การยกเว้นและจำกัดข้างต้นอาจไม่นำมาใช้แก่ท่าน";
"Part40" = "7.     การจำกัดความรับผิด     เท่าที่กฎหมายที่เกี่ยวข้องมิได้ห้ามไว้ ไม่ว่ากรณีใดๆ Apple ไม่จำต้องรับผิดเพื่อการบาดเจ็บเสียหายส่วนบุคคลหรือความเสียหายอันเนื่องมาจากการผิดสัญญา ความเสียหายพิเศษ ความเสียหายทางอ้อม หรือความเสียหายต่อเนื่อง  ซึ่งรวมถึงแต่ไม่จำกัดเฉพาะค่าเสียหายเพื่อการสูญกำไร การเสียหายหรือสูญเสียข้อมูล การไม่สามารถส่งหรือรับข้อมูลใดๆ การหยุดชะงักของธุรกิจ หรือความสูญหายหรือเสียหายทางการค้าอื่นใดที่เกิดจากหรือเกี่ยวกับการที่ท่านใช้หรือไม่สามารถใช้ซอฟต์แวร์ของ Apple และบริการ หรือแอพพลิเคชั่นหรือซอฟต์แวร์ของบุคคลภายนอกที่เกี่ยวข้องกับซอฟต์แวร์ของ Apple ไม่ว่าจะเกิดด้วยเหตุใดก็ตาม โดยมิพักต้องคำนึงถึงทฤษฎีความรับผิด (ในมูลสัญญา มูลละเมิด หรือมูลอื่น) และแม้ Apple จะได้รับแจ้งถึงความเป็นไปได้ที่จะเกิดความเสียหายดังกล่าวแล้วก็ตาม บางประเทศยังไม่อนุญาตให้ตัดหรือจำกัดความรับผิดเพื่อการบาดเจ็บเสียหายส่วนบุคคล ความเสียหายอันเนื่องมาจากการผิดสัญญาหรือความเสียหายต่อเนื่อง ดังนั้น การจำกัดนี้อาจไม่นำมาใช้แก่ท่าน ไม่ว่ากรณีใดๆ ความรับผิดทั้งปวงของ Apple ต่อท่านเพื่อค่าเสียหายทั้งปวง (นอกจากที่กฎหมายอาจกำหนดไว้ในกรณีเกี่ยวกับการบาดเจ็บเสียหายส่วนบุคคล) จะไม่เกินกว่าห้าสิบ (50.00) เหรียญสหรัฐ ข้อจำกัดข้างต้นย่อมมีผลใช้บังคับแม้การแก้ไขเยียวยาที่ระบุไว้ข้างต้นจะไม่เป็นไปตามวัตถุประสงค์ในสาระสำคัญ";
"Part41" = "8.     การควบคุมการส่งออก     ท่านจะใช้หรือส่งออกหรือส่งออกซ้ำโดยประการอื่นซึ่งซอฟต์แวร์ของ Apple ไม่ได้ เว้นแต่กฎหมายสหรัฐและกฎหมายประเทศต่างๆ ที่ท่านได้ซอฟต์แวร์ของ Apple มาจะอนุญาต  โดยเฉพาะอย่างยิ่ง ซอฟต์แวร์ของ Apple จะส่งออกหรือส่งออกซ้ำไป (ก) ยังประเทศใดๆ ที่สหรัฐอเมริกาสั่งห้ามส่งไป หรือ (ข) ให้บุคคลใดๆ ที่อยู่ในรายชื่อผู้มีสัญชาติซึ่งระบุไว้เป็นพิเศษของกระทรวงการคลังสหรัฐหรือรายชื่อบุคคลหรือองค์กรที่ถูกปฏิเสธโดยกระทรวงพาณิชย์สหรัฐ หรือบัญชีรายชื่อบุคคลต้องห้ามอื่นใด เป็นต้น โดยการใช้ซอฟต์แวร์ของ Apple  ท่านรับรองและรับประกันว่า ท่านไม่ประจำอยู่ในประเทศใดๆ ดังกล่าว หรือมีชื่อปรากฏในรายชื่อใดๆ ดังกล่าว ท่านยังตกลงด้วยว่า ท่านจะไม่ใช้ซอฟต์แวร์ของ Apple เพื่อการใดๆ ที่กฎหมายสหรัฐห้ามไว้  ซึ่งรวมถึงโดยไม่จำกัดเฉพาะการพัฒนา ออกแบบ ทำ หรือผลิตขีปนาวุธ อาวุธนิวเคลียร์ อาวุธเคมี หรืออาวุธชีวภาพ";
"Part42" = "9.     ผู้ใช้ปลายทางภาครัฐ     ซอฟต์แวร์ของ Apple และเอกสารที่เกี่ยวข้องเป็น “สินค้า” ตามที่นิยามไว้ใน 48 ซี.เอฟ.อาร์. §2.101 อันประกอบด้วย “ซอฟต์แวร์คอมพิวเตอร์เชิงพาณิชย์” และ “เอกสารซอฟต์แวร์คอมพิวเตอร์เชิงพาณิชย์” ตามที่ใช้ใน 48 ซี.เอฟ.อาร์. §12.212 หรือ 48 ซี.เอฟ.อาร์. §227.7202 แล้วแต่กรณี โดยสอดคล้องกับ 48 ซี.เอฟ.อาร์. §12.212 หรือ 48 ซี.เอฟ.อาร์. §227.7202-1 ถึง §227.7202-4 แล้วแต่กรณี ซอฟต์แวร์คอมพิวเตอร์เชิงพาณิชย์และเอกสารซอฟต์แวร์คอมพิวเตอร์เชิงพาณิชย์นั้น อนุญาตให้ผู้ใช้ที่เป็นรัฐบาลสหรัฐใช้ (ก) เป็นสินค้าเท่านั้น และ (ข) โดยให้มีเพียงสิทธิที่ให้แก่ผู้ใช้ปลายทางรายอื่นตามข้อกำหนดและเงื่อนไขในใบอนุญาตให้ใช้สิทธินี้ ส่วนสิทธิในงานที่ไม่ได้เผยแพร่นั้น ขอสงวนไว้ตามกฎหมายลิขสิทธิ์สหรัฐ";
"Part43" = "10.     กฎหมายที่ใช้บังคับและการแยกจากกันได้ของข้อสัญญา     ใบอนุญาตให้ใช้สิทธินี้ให้ใช้บังคับและตีความตามกฎหมายมลรัฐแคลิฟอร์เนีย โดยมิพักต้องคำนึงถึงหลักว่าด้วยการขัดกันแห่งกฎหมาย ใบอนุญาตให้ใช้สิทธินี้มิให้บังคับตามอนุสัญญาสหประชาชาติว่าด้วยการซื้อขายสินค้าระหว่างประเทศ ซึ่งขอยกเว้นผลบังคับใช้ไว้โดยชัดแจ้ง ถ้าท่านเป็นผู้บริโภคในสหราชอาณาจักร ใบอนุญาตให้ใช้สิทธินี้จะบังคับตามกฎหมายประเทศที่ท่านพำนักอยู่  ถ้าศาลที่มีอำนาจใดวินิจฉัยว่า ข้อความหรือส่วนใดๆ ของใบอนุญาตให้ใช้สิทธิไม่สามารถใช้บังคับได้ ให้ส่วนที่เหลือของใบอนุญาตให้ใช้สิทธินี้ยังคงใช้มีผลบังคับต่อไปอย่างเต็มที่";
"Part44" = "11.     สัญญาอันบริบูรณ์ ภาษาที่ใช้บังคับ     ใบอนุญาตให้ใช้สิทธินี้เป็นสัญญาอันบริบูรณ์ระหว่างท่านกับ Apple ในส่วนที่เกี่ยวกับซอฟต์แวร์ของ Apple และให้แทนที่ความเข้าใจที่มีอยู่ก่อนหรือที่มีขึ้นพร้อมกันทั้งหมดเกี่ยวกับเรื่องดังกล่าว การแก้ไขหรือเปลี่ยนแปลงสัญญานี้จะไม่มีผลผูกพัน เว้นแต่จะทำเป็นหนังสือลงลายมือชื่อโดย Apple คำแปลใบอนุญาตให้ใช้สิทธิจัดทำขึ้นตามความต้องการท้องถิ่น และถ้ามีข้อพิพาทระหว่างฉบับภาษาอังกฤษกับฉบับที่มิใช่ภาษาอังกฤษ ให้ใช้ฉบับภาษาอังกฤษของใบอนุญาตให้ใช้สิทธินี้บังคับเท่าที่กฎหมายท้องถิ่นในประเทศของท่านมิได้ห้ามไว้";
"Part45" = "12.     การยอมรับบุคคลภายนอก ส่วนต่างๆ ของซอฟต์แวร์ของ Apple อาจใช้หรือมีซอฟต์แวร์ของบุคคลภายนอกและงานอันมีลิขสิทธิ์อื่นๆ อยู่ด้วย ข้อความยอมรับ ข้อกำหนดในใบอนุญาตให้ใช้สิทธิ และข้อความปฏิเสธความรับผิดสำหรับสิ่งดังกล่าวมีอยู่ในเอกสารอิเล็กทรอนิกส์ สำหรับซอฟต์แวร์ของ Apple และการใช้ซอฟต์แวร์ดังกล่าวของท่านจะอยู่ภายใต้การบังคับของข้อกำหนดที่เกี่ยวข้องกับการใช้งานซอฟต์แวร์ดังกล่าว  ";
"Part46" = "EA1576";
"Part47" = "16/08/2018";